[LiveUpdate_FormLiveUpdateMain]
btnClose.Hint=Sulje
btnUpdate.Caption=Lataa
btnConfirmCancel.Caption=Peruuta
btnUptoDateOK.Caption=OK
lblUpToDate.Caption=Onnittelut! Sinulla on jo uusin versio. Päivitystä ei ole saatavana.
lblGetUptInfo.Caption=Haetaan päivitystietoja, odota hetki ...
btnConfigCancel.Caption=Peruuta
btnMinimize.Caption=Pienennä
btnProcessCancel.Caption=Peruuta
btnUptWeb.Caption=Päivitä nyt
btnWebCancel.Caption=Päivitä myöhemmin
lblUpdateFailed.Caption=Päivitys epäonnistui! Yritä myöhemmin uudelleen. Tai klikkaa Yritä uudelleen.
btnFailedClose.Caption=Sulje
btnRetry.Caption=Yritä uudelleen
btnSuccessClose.Caption=OK

[LiveUpdate_M]
Item=Nimike
Size=Koko
Version=Versio
DownLoading=Ladataan
OK=OK
Close=Sulje
LiveUpdate=Päivitä
UpdateSuccess=%s on päivitetty. Voit nyt nauttia uusimmista toiminnoista ja parannuksista.
WebDownLoad=Ohjelman %s uusi versio on saatavilla. Päivitä nyt saadaksesi uusimmat toiminnot ja parannukset. Se on maksuton.
AvailableUpdates=Saatavilla olevat päivitykset
NewVersion=Uusi versio
VersionUpdate=Versiopäivitys
ImportantUpdate=Tärkeä päivitys

